GUdaoxi/FH_project/TSI/Library/Devices/fm33fh0xx_tsi_driver.c
#include <string.h>

#ifndef TSI_SIM_DEV
    #include "fm33fh0xx.h"
#else
    #include "fm33fh0xx_sim.h"
#endif
#include "tsi_driver.h"
#include "tsi_object.h"

/* Macros -------------------------------------------------------------------*/
#define CAT(A, B, C)                A ## B ## C
#define DMA_REG(REG, ID)            CAT(DMA->CH, ID, REG)

#define TSI_IDAC_DIR_SOURCE         (0U)
#define TSI_IDAC_DIR_SINK           (1U)

/* Constants ----------------------------------------------------------------*/
/** GPIO port list. */
static GPIO_Type *const PORTS[] = {
    GPIOA, GPIOB, GPIOC, GPIOD,
    GPIOE, GPIOF, GPIOG, GPIOH,
};

/** Instance list. */
#define TSI_DEV_INSTANCE_NUM            (1U)
static TSI_Type *const INSTANCES[TSI_DEV_INSTANCE_NUM] = {
    TSI,
};

/* Defines ------------------------------------------------------------------*/
/** Sensor configuration struct. */
typedef struct _TSI_DevSnsConf {
    /** Sensor configuration reg value */
    uint32_t conf[TSI_MAX_SCANGROUP_SENSOR_NUM];

    /**
     * IDAC0 step.
     *
     * * 0 for 37.5nA,
     * * 1 for 75nA,
     * * 2 for 300nA,
     * * 3 for 600nA,
     * * 4 for 1.2uA,
     * * 5 for 2.4uA,
     * * 6 for 4.8uA.
     */
    uint8_t idac1Step[TSI_MAX_SCANGROUP_SENSOR_NUM];

    /**
     * IDAC1 step.
     *
     * * 0 for 37.5nA,
     * * 1 for 75nA,
     * * 2 for 300nA,
     * * 3 for 600nA,
     * * 4 for 1.2uA,
     * * 5 for 2.4uA,
     * * 6 for 4.8uA.
     */
    uint8_t idac2Step[TSI_MAX_SCANGROUP_SENSOR_NUM];

} TSI_DevSnsConfTypeDef;

/** Device driver private data struct. */
typedef struct _TSI_DevPrivate {
    /** Sensor configurations. */
    TSI_DevSnsConfTypeDef sensorConfs[TSI_TOTAL_SCAN_NUM];

    /**
     * In Blocking/IT mode: Current scanning sensor index(in scan group).
     * In DMA mode: Not used.
     */
    uint16_t snsIdx;

    /**
     * Available sensor num in current scan group.
     */
    uint16_t snsNum;

    /** LPM mode flag. */
    uint8_t isLPM;

    /** PLL enable status before entering LPM mode. */
    uint8_t isPLLEnabledBeforeLPM;

    /** Mark enabled sensor ids while scanning self-cap scan group. */
    uint16_t enabledSensors[TSI_MAX_SCANGROUP_SENSOR_NUM];

#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
    /** Sensor data. */
    uint32_t sensorData[TSI_TOTAL_SCAN_NUM][TSI_MAX_SCANGROUP_SENSOR_NUM];
#endif

} TSI_DevPrivateTypeDef;

/* Private data -------------------------------------------------------------*/
#if (TSI_DEV_INSTANCE_NUM >= 2)
    #error "Configured instance number is not available on selected device."
#endif

/** Device driver private data instance(s). */
static TSI_DevPrivateTypeDef devPrivateData[TSI_DEV_INSTANCE_NUM];

/* Private function prototypes ----------------------------------------------*/
/* Control */
static void TSI_ResetModule(TSI_Type *instance);
static bool TSI_ConfigSensor(TSI_WidgetTypeDef *widget, TSI_SensorTypeDef *sensor,
                             TSI_DevSnsConfTypeDef *confs, uint16_t idx);
static void TSI_ConfigScanTiming(TSI_DriverTypeDef *drv, TSI_ScanGroupTypeDef *group);
static bool TSI_IsScanning(TSI_Type *instance);
static void TSI_DisableAllChannel(TSI_Type *instance);
static void TSI_EnableChannel(TSI_Type *instance, uint32_t ch);
static void TSI_SetChannelTx(TSI_Type *instance, uint32_t ch);
static void TSI_SetChannelRx(TSI_Type *instance, uint32_t ch);
static void TSI_SetIDAC1Step(TSI_Type *instance, uint8_t step);
static void TSI_SetIDAC2Step(TSI_Type *instance, uint8_t step);
#ifndef TSI_UNIT_TEST
    static void TSI_LoadIDAC1Trim(TSI_Type *instance, uint8_t step, uint8_t dir);
    static void TSI_LoadIDAC2Trim(TSI_Type *instance, uint8_t step, uint8_t dir);
#endif  /* TSI_UNIT_TEST */
static void TSI_EnableIT(TSI_Type *instance);
static void TSI_DisableIT(TSI_Type *instance);
#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
    static void TSI_SetupDMA(TSI_Type *instance);
    static void TSI_ResetDMA(TSI_Type *instance);
#endif

/* Data r/w */
static uint32_t TSI_ReadData(TSI_Type *instance);
#ifdef TSI_LIB_USE_ASSERT
    static uint32_t TSI_GetTxChannel(uint32_t reg);
    static uint32_t TSI_GetRxChannel(uint32_t reg);
#endif
#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
static void TSI_StartDMA(TSI_Type *instance, uint32_t *config, uint32_t *data,
                         uint16_t size);
static void TSI_StopDMA(TSI_Type *instance);
#endif

/* Miscs */
static void TSI_SetGroundOutput(TSI_DriverTypeDef *driver, TSI_SensorTypeDef *sensor);
static void TSI_ResetGroundOutput(TSI_DriverTypeDef *driver);

/* API implementations ------------------------------------------------------*/
TSI_RetCode TSI_Dev_Init(TSI_DriverTypeDef *drv)
{
    if(drv->instanceId == 0U) {
        uint16_t *pTrim;

        /* Reset TSI and enable bus clock */
        TSI_ResetModule(TSI);
        CMU->PCLKCR1 |= (0x1UL << 7U);
        CMU->PCLKCR2 |= (0x1UL << 11U);

        /* Disable channel pull-down */
        TSI->TEST &= ~(0x1UL << 18U);

        /* Disable CINTA/CINTB pull-up */
        GPIOA->INEN &= ~(0x3UL << 14U);
        GPIOA->PUDEN &= ~(0x3UL << 14U);

        /* Configure INTMUX */
        INTMUX->CR2 &= ~(0x3UL << 6U);
        INTMUX->CR2 |= (0x0UL << 6U);

        /* Setup reference voltage */
        TSI->VREFCR &= ~(0x3UL << 27U);
#if (TSI_DEV_REF_MV == 1500U)
        TSI->VREFCR |= (0x1UL << 27U);
#elif (TSI_DEV_REF_MV == 2000U)
        TSI->VREFCR |= (0x2UL << 27U);
#elif (TSI_DEV_REF_MV == 2500U)
        TSI->VREFCR |= (0x3UL << 27U);
#endif

#ifndef TSI_UNIT_TEST
        /* Load trim value */
        pTrim = (uint16_t *) 0x1FFFFA84UL;
        if(*pTrim != 0xFFFFU) {
            TSI_ASSERT(((*pTrim) ^ (*(pTrim + 2U))) == 0xFFFFU);
            TSI->VREFCR &= ~(0x7FUL << 0U);
            TSI->VREFCR |= (((*pTrim) & 0x7FU) << 0U);
        }
        pTrim = (uint16_t *) 0x1FFFFA88UL;
        if(*pTrim != 0xFFFFU) {
            TSI_ASSERT(((*pTrim) ^ (*(pTrim + 2U))) == 0xFFFFU);
            TSI->VREFCR &= ~(0x7FUL << 16U);
            TSI->VREFCR |= (((*pTrim) & 0x7FU) << 16U);
        }
        pTrim = (uint16_t *) 0x1FFFFA8CUL;
        if(*pTrim != 0xFFFFU) {
            TSI_ASSERT(((*pTrim) ^ (*(pTrim + 2U))) == 0xFFFFU);
            TSI->VREFCR &= ~(0x7FUL << 8U);
            TSI->VREFCR |= (((*pTrim) & 0x7FU) << 8U);
        }
#endif

        /* Enable NVIC */
        NVIC_DisableIRQ(MUX19_IRQn);
        NVIC_ClearPendingIRQ(MUX19_IRQn);
        NVIC_SetPriority(MUX19_IRQn, TSI_IRQ_PRIORITY);
        NVIC_EnableIRQ(MUX19_IRQn);

        /* Enable TSI */
        TSI->CFGR |= (0x1UL << 0U);

