GUdaoxi/FH_project/TSI/Library/Devices/fm33fh0xx_tsi_driver.c
#if (TSI_USE_SHIELD == 1U)
        /* When using shield, pull-down must use GPIO GND output. */
        TSI->SHLDGNDCR0 = 0xFFFFFFFFUL;
        TSI->SHLDGNDCR1 = 0xFUL;
#endif

#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
        /* Setup DMA */
        TSI_SetupDMA(TSI);
#if (TSI_DMA_IRQ_PRIORITY_BY_USER == 0U)
        NVIC_DisableIRQ(MUX21_IRQn);
        NVIC_SetPriority(MUX21_IRQn, TSI_DMA_IRQ_PRIORITY);
#endif
        NVIC_EnableIRQ(MUX21_IRQn);
#endif

#if (TSI_DEV_VDD_MV >= 4000U)
        /* FM515 U02 TSI compensation */
        RMU->PDRCR |= (0x3UL << 1U);
#endif

        /* Link driver */
        memset(&devPrivateData[0], 0, sizeof(TSI_DevPrivateTypeDef));
        drv->context = &devPrivateData[0];
    }

    return TSI_PASS;
}

TSI_RetCode TSI_Dev_Deinit(TSI_DriverTypeDef *drv)
{
    TSI_Type *instance;

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    /* Reset TSI and disable TSI bus clock */
    TSI_ResetModule(instance);

    /* Disable channel pull-down */
    TSI->TEST &= ~(0x1UL << 18U);

    /* Disable CINTA/CINTB pull-up */
    GPIOA->INEN &= ~(0x3UL << 14U);
    GPIOA->PUDEN &= ~(0x3UL << 14U);

#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
    /* Reset DMA */
    TSI_ResetDMA(instance);
#endif

    /* Disable NVIC */
    NVIC_DisableIRQ(MUX19_IRQn);
    NVIC_ClearPendingIRQ(MUX19_IRQn);

    /* Disable TSI */
    TSI->CFGR &= ~(0x1UL << 0U);

    return TSI_PASS;
}

void TSI_Dev_EnterLPM(TSI_DriverTypeDef *drv)
{
    TSI_Type *instance;
    TSI_DevPrivateTypeDef *devPrivate = (TSI_DevPrivateTypeDef *) drv->context;

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    if(devPrivate->isLPM != 0U) {
        /* Already in LPM mode */
        return;
    }

    /* Disable TSI module */
    instance->CFGR &= ~(0x1UL);
    /* Store status and disable TSI_PLL */
    if((instance->PLLCR & (0x1UL << 0U)) != 0U) {
        devPrivate->isPLLEnabledBeforeLPM = 1U;
    }
    instance->PLLCR &= ~(0x1UL << 0U);

    /* Set LPM mode flag */
    devPrivate->isLPM = 1U;
}

void TSI_Dev_LeaveLPM(TSI_DriverTypeDef *drv)
{
    TSI_Type *instance;
    TSI_DevPrivateTypeDef *devPrivate = (TSI_DevPrivateTypeDef *) drv->context;

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    if(devPrivate->isLPM != 1U) {
        /* Already left LPM mode */
        return;
    }

    /* Enable TSI module */
    instance->CFGR |= 0x1UL;
    /* Restore TSI_PLL status */
    if(devPrivate->isPLLEnabledBeforeLPM != 0U) {
        instance->PLLCR |= (0x1UL << 0U);
    }

    /* Clear LPM mode flag */
    devPrivate->isLPM = 0U;
}

TSI_RetCode TSI_Dev_SetupClock(TSI_DriverTypeDef *drv, const TSI_ClockConfTypeDef *clockConf)
{
    TSI_Type *instance;

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    TSI_ASSERT((clockConf->snsClockSel == 0U) ||
               (clockConf->snsClockSel == 1U) ||
               (clockConf->snsClockSel == 2U));
    TSI_ASSERT((clockConf->sscWidth >= 6U && clockConf->sscWidth <= 13U));
    TSI_ASSERT((clockConf->prsWidth >= 6U && clockConf->prsWidth <= 13U));
    if(clockConf->sscWidth == 6U) {
        TSI_ASSERT((clockConf->sscPoint == 0U) ||
                   (clockConf->sscPoint == 1U));
    }
    else if(clockConf->sscWidth == 7U) {
        TSI_ASSERT((clockConf->sscPoint == 0U) ||
                   (clockConf->sscPoint == 1U) ||
                   (clockConf->sscPoint == 2U));
    }
    TSI_ASSERT((clockConf->pllRefPsc > 0U) && (clockConf->pllRefPsc <= 128U));
    TSI_ASSERT((clockConf->pllMul > 0U) && (clockConf->pllMul <= 80U));

    /* Select and enable operation clock */
    if(clockConf->opClockSel == 0U) {
        /* APBCLK as operation clock */
        CMU->OPCCR2 &= ~(0x1UL << 0U);
    }
    else {
        /* RCHF as operation clock */
        CMU->OPCCR2 |= (0x1UL << 0U);
    }
    CMU->OPCER1 |= (0x1UL << 16U);      /* Enable operation clock */

    /* Configure modulator clock */
    instance->CKCR &= ~(0xFFUL << 8U);
    instance->CKCR |= ((uint32_t)clockConf->modClockPsc - 1UL) << 8U;

    /* Select sensor clock source */
    if(clockConf->snsClockSrc == 0U) {
        /* Modulator clock */
        instance->CKCR &= ~(0x1UL << 0U);
        instance->PLLCR &= ~(0x1UL << 0U);   /* Disable TSI_PLL */
    }
    else {
        /* TSI_PLL VCO clock, need to configure TSI_PLL */
        instance->CKCR |= (0x1UL << 0U);
        instance->PLLCR &= ~(0x1UL << 0U);   /* Disable TSI_PLL */
        instance->PLLCR &= ~(0x7FUL << 1U);
        instance->PLLCR |= (((uint32_t)clockConf->pllRefPsc - 1UL) << 1U);   /* PLL prescaler */
        instance->PLLCR &= ~(0x3FFUL << 16U);
        instance->PLLCR |= (((uint32_t)clockConf->pllMul - 1UL) << 16U);     /* PLL multiplier */
        instance->PLLCR |= (0x1UL << 0U);    /* Enable TSI_PLL */
        /* Wait until TSI_PLL is locked */
        TSI_WAIT_TIMEOUT(((instance->PLLCR & (0x1UL << 8U)) != 0UL),
                         TSI_DEV_PLL_LOCK_TIMEOUT_VALUE) {
            return TSI_TIMEOUT;
        }
        TSI_WAIT_TIMEOUT_END()
    }

    /* Configure sensor clock selection */
    if(clockConf->snsClockSel == 0U) {
        /* Direct clock */
        instance->CKCR &= ~(0x1UL << 2U);    /* Disable divider SSC */
        instance->CCR &= ~(0x1UL << 0U);     /* Disable switch clock PRS */
    }
    else if(clockConf->snsClockSel == 1U) {
        /* PRS-modulated clock */
        instance->CKCR &= ~(0x1UL << 2U);    /* Disable divider SSC */
        instance->CCR &= ~(0x1UL << 0U);     /* Disable switch clock PRS */
        instance->PRSSW &= ~(0xFUL << 16U);
        instance->PRSSW |= ((uint32_t)clockConf->prsWidth << 16U);   /* PRS width */
        instance->PRSSW &= ~(0x1FFFUL << 0U);
        instance->PRSSW |= ((uint32_t)clockConf->prsCoeff << 0U);    /* PRS coefficient */
        instance->CCR |= (0x1UL << 0U);      /* Enable switch clock PRS */
    }
    else if(clockConf->snsClockSel == 2U) {
        /* SSC-modulated clock */
        instance->CKCR &= ~(0x1UL << 2U);    /* Disable divider SSC */
        instance->CCR &= ~(0x1UL << 0U);     /* Disable switch clock PRS */
        instance->CKCR &= ~(0x3UL << 4U);
        instance->CKCR |= ((uint32_t)clockConf->sscPoint << 4U);     /* SSC freq point num */
        instance->PRSSSC |= ((uint32_t)clockConf->sscWidth << 16U);  /* SSC width */
        instance->PRSSSC &= ~(0x1FFFUL << 0U);
        instance->PRSSSC |= ((uint32_t)clockConf->sscCoeff << 0U);   /* SSC coefficient */
        instance->CKCR |= (0x1UL << 2U);     /* Enable divider SSC */
    }

    return TSI_PASS;
}

TSI_RetCode TSI_Dev_ResetClock(TSI_DriverTypeDef *drv)
{
    TSI_Type *instance;

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

