GUdaoxi/FH_project/TSI/Library/Devices/fm33fh0xx_tsi_driver.c
    instance->CKCR &= ~(0x1UL << 2U);       /* Disable divider SSC */
    instance->CCR &= ~(0x1UL << 0U);        /* Disable switch clock PRS */
    instance->PLLCR &= ~(0x1UL << 0U);      /* Disable TSI_PLL */
    instance->CKCR &= ~(0xFFUL << 8U);      /* Modulator clock prescaler = 1 */
    instance->CKCR &= ~(0x1UL << 0U);       /* Modulator clock as sensor clock source */
    CMU->OPCCR2 &= ~(0x1UL << 0U);          /* APBCLK as operation clock */

    return TSI_PASS;
}

TSI_RetCode TSI_Dev_SetupPort(TSI_DriverTypeDef *drv, const TSI_IOConfTypeDef *io)
{
    GPIO_Type *port;
    uint32_t portId;
    uint32_t pin;

    TSI_UNUSED(drv)

    /* Get GPIO info */
    portId = io->port;
    pin = io->pin;
    TSI_ASSERT(portId < (sizeof(PORTS) / sizeof(GPIO_Type *)));
    port = PORTS[portId];

    /* Configure GPIO */
    port->FCR |= (0x3UL << (pin * 2U));     /* Analog mode */
    port->PUDEN &= ~(0x10001UL << pin);     /* Disable pull-up and pull down */

    return TSI_PASS;
}

TSI_RetCode TSI_Dev_ResetPort(TSI_DriverTypeDef *drv, const TSI_IOConfTypeDef *io)
{
    GPIO_Type *port;
    uint32_t portId;
    uint32_t pin;

    TSI_UNUSED(drv)

    /* Get GPIO info */
    portId = io->port;
    pin = io->pin;
    TSI_ASSERT(portId < (sizeof(PORTS) / sizeof(GPIO_Type *)));
    port = PORTS[portId];

    /* Set to high impedance */
    port->FCR &= ~(0x3UL << (pin * 2U));
    port->FCR |= (0x1UL << (pin * 2U));     /* Input mode */
    port->INEN &= ~(0x1UL << pin);          /* Disable input */
    port->PUDEN &= ~(0x10001UL << pin);     /* Disable pull-up and pull down */

    return TSI_PASS;
}

#if (TSI_USE_SHIELD == 1U)
TSI_RetCode TSI_Dev_SetupShield(TSI_DriverTypeDef *drv, const TSI_ShieldConfTypeDef *shield)
{
    TSI_Type *instance;
    uint8_t ch = shield->channel;

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    if(ch < 32U) {
        instance->SHLDCR0 |= (0x1UL << ch);
    }
    else {
        instance->SHLDCR1 |= (0x1UL << (ch - 32U));
    }

    return TSI_PASS;
}

TSI_RetCode TSI_Dev_ResetShield(TSI_DriverTypeDef *drv, const TSI_ShieldConfTypeDef *shield)
{
    TSI_Type *instance;
    uint8_t ch = shield->channel;

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    if(ch < 32U) {
        instance->SHLDCR0 &= ~(0x1UL << ch);
    }
    else {
        instance->SHLDCR1 &= ~(0x1UL << (ch - 32U));
    }

    return TSI_PASS;
}

TSI_RetCode TSI_Dev_ResetAllShields(TSI_DriverTypeDef *drv)
{
    TSI_Type *instance;
    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    instance->SHLDCR0 = 0x0UL;
    instance->SHLDCR1 = 0x0UL;

    return TSI_PASS;
}

#endif  /* TSI_USE_SHIELD == 1U */

TSI_RetCode TSI_Dev_SetupScanGroup(TSI_DriverTypeDef *drv, TSI_ScanGroupTypeDef *group)
{
    bool res;
    TSI_Type *instance;
    TSI_DevPrivateTypeDef *devPrivate = (TSI_DevPrivateTypeDef *) drv->context;

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    /* Check scan stat */
    if(TSI_IsScanning(instance)) {
        /* Previous configured scan is running,
           user may call TSI_Dev_StopScan() to stop. */
        return TSI_WAIT;
    }

    /* Setup scan group sensors */
    if(group->type == TSI_SCAN_GROUP_SELF_CAP_PARALLEL) {
        /* Self-cap sensor parallel group: Only set the main sensor. */
        TSI_SensorTypeDef *sensor = TSI_SensorPointers[group->sensors[0]];
        TSI_WidgetTypeDef *widget = sensor->meta->parent;
        res = TSI_ConfigSensor(widget, sensor, devPrivate->sensorConfs, 0U);
        if(!res) {
            return TSI_ERROR;
        }
        /* sensor num is always 1 */
        devPrivate->snsNum = 1U;
    }
    else if(group->type == TSI_SCAN_GROUP_SELF_CAP) {
        uint16_t snsScanIdx = 0U;   /* For addressing self-cap conf index and counting
                                       enabled sensor num */
        TSI_FOREACH_OBJ(uint16_t *, snsId, group->sensors, group->size) {
            TSI_SensorTypeDef *sensor = TSI_SensorPointers[*snsId];
            TSI_WidgetTypeDef *widget = sensor->meta->parent;
            if(widget->enable != 0U) {
                res = TSI_ConfigSensor(widget, sensor, devPrivate->sensorConfs,
                                       snsScanIdx);
                if(!res) {
                    return TSI_ERROR;
                }
                devPrivate->enabledSensors[snsScanIdx] = *snsId;
                snsScanIdx++;
            }
        }
        TSI_FOREACH_END()
        devPrivate->snsNum = snsScanIdx;
    }
    else if(group->type == TSI_SCAN_GROUP_MUTUAL_CAP) {
        TSI_FOREACH_OBJ(uint16_t *, snsId, group->sensors, group->size) {
            TSI_SensorTypeDef *sensor = TSI_SensorPointers[*snsId];
            TSI_WidgetTypeDef *widget = sensor->meta->parent;
            res = TSI_ConfigSensor(widget, sensor, devPrivate->sensorConfs,
                                   (uint16_t)idx);
            if(!res) {
                return TSI_ERROR;
            }
        }
        TSI_FOREACH_END()
        /* sensor num is always equals to group size */
        devPrivate->snsNum = group->size;
    }

    /* Setup scan timing */
    TSI_ConfigScanTiming(drv, group);

    return TSI_PASS;
}

TSI_RetCode TSI_Dev_StartScan(TSI_DriverTypeDef *drv)
{
    TSI_Type *instance;
    TSI_DevPrivateTypeDef *devPrivate = (TSI_DevPrivateTypeDef *) drv->context;
    const TSI_ScanGroupTypeDef *group = &drv->scanGroups[drv->scanGroupIdx];
    TSI_DevSnsConfTypeDef *snsConf;
    uint8_t idac2Dir;

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    /* Enable sensors */
    TSI_DisableAllChannel(instance);
    TSI_FOREACH_OBJ(uint16_t *, snsId, group->sensors, group->size) {
        const TSI_SensorTypeDef *sensor = TSI_SensorPointers[*snsId];
        TSI_WidgetTypeDef *widget = sensor->meta->parent;
        if(group->type != TSI_SCAN_GROUP_SELF_CAP_PARALLEL) {
            if(widget->enable == 0U) {
                continue;
            }
        }
        else if(idx == 0UL && widget->enable == 0U) {
            /* Self-cap parallel group: Only configure the first sensor. */
            break;
        }
        TSI_EnableChannel(instance, sensor->meta->rxChannel);
        TSI_INFO("TSI_Dev_StartScan - Enable CH%02d", sensor->meta->rxChannel);
        if(TSI_WIDGET_IS_MUTUAL_CAP(widget)) {
            TSI_SetChannelRx(instance, sensor->meta->rxChannel);
            TSI_INFO("TSI_Dev_StartScan - Set as RX");
            TSI_EnableChannel(instance, sensor->meta->txChannel);
            TSI_SetChannelTx(instance, sensor->meta->txChannel);
            TSI_INFO("TSI_Dev_StartScan - Enable CH%02d", sensor->meta->txChannel);
            TSI_INFO("TSI_Dev_StartScan - Set as TX");
        }
    }
    TSI_FOREACH_END()

    if(group->type == TSI_SCAN_GROUP_SELF_CAP ||
            group->type == TSI_SCAN_GROUP_SELF_CAP_PARALLEL) {
        /* Self-cap sensor */
        /* IDAC1 mode = 1, IDAC2 mode = 1 */
        instance->ANACR |= (0x1UL << 16U);
        instance->ANACR |= (0x1UL << 17U);
        idac2Dir = TSI_IDAC_DIR_SOURCE;

