GUdaoxi/FH_project/TSI/Library/Devices/fm33fh0xx_tsi_driver.c
#if (TSI_USE_SHIELD == 1U)
        /* Enable shield output */
        instance->ANACR &= ~(0x3UL << 8U);
        instance->ANACR |= (0x1UL << 8U);
        instance->TEST &= ~(0x1UL << 19U);
        instance->CFGR &= ~(0x1UL << 4U);
#endif
    }
    else if(group->type == TSI_SCAN_GROUP_MUTUAL_CAP) {
        /* Mutual-cap sensor */
        /* IDAC1 mode = 1, IDAC2 mode = 0 */
        instance->ANACR |= (0x1UL << 16U);
        instance->ANACR &= ~(0x1UL << 17U);
        idac2Dir = TSI_IDAC_DIR_SINK;
    }
    else {
        /* Cannot be here */
        TSI_ASSERT(0U);
        return TSI_PARAM_ERR;
    }

    if(drv->scanMode != TSI_DRV_SCAN_MODE_DMA) {
        /* Reset sensor index */
        devPrivate->snsIdx = 0U;

        /* Setup configuration for first sensor */
        snsConf = &devPrivate->sensorConfs[drv->freqIdx];
        instance->SPCFGR = snsConf->conf[0];
#ifndef TSI_UNIT_TEST
        TSI_LoadIDAC1Trim(instance, snsConf->idac1Step[0], TSI_IDAC_DIR_SOURCE);
        TSI_LoadIDAC2Trim(instance, snsConf->idac2Step[0], idac2Dir);
#endif  /* TSI_UNIT_TEST */
        TSI_SetIDAC1Step(instance, snsConf->idac1Step[0]);
        TSI_SetIDAC2Step(instance, snsConf->idac2Step[0]);
    }
#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
    else {
        /* When using DMA, sensors in one scan group must use
           same IDAC step. We use IDAC step of the first sensor. */
        snsConf = &devPrivate->sensorConfs[drv->freqIdx];
#ifndef TSI_UNIT_TEST
        TSI_LoadIDAC1Trim(instance, snsConf->idac1Step[0], TSI_IDAC_DIR_SOURCE);
        TSI_LoadIDAC2Trim(instance, snsConf->idac2Step[0], idac2Dir);
#endif  /* TSI_UNIT_TEST */
        TSI_SetIDAC1Step(instance, snsConf->idac1Step[0]);
        TSI_SetIDAC2Step(instance, snsConf->idac2Step[0]);
    }
#endif

    if((group->opt & TSI_DEV_OPT_IDLE_CONNECTION_MASK) == TSI_DEV_OPT_IDLE_GROUNDED) {
        TSI_SensorTypeDef *sensor = NULL;
        if(group->type == TSI_SCAN_GROUP_SELF_CAP) {
            sensor = drv->sensors[devPrivate->enabledSensors[0]];
        }
        else if(group->type == TSI_SCAN_GROUP_MUTUAL_CAP) {
            sensor = drv->sensors[group->sensors[0]];
        }
        else {
            /* Do nothing */
        }
        if(sensor != NULL) {
            /* Set other channel output to GND */
            TSI_SetGroundOutput(drv, sensor);
        }
    }
#if (TSI_USE_SHIELD == 1U)
    else if(((group->opt & TSI_DEV_OPT_IDLE_CONNECTION_MASK) == TSI_DEV_OPT_IDLE_SHIELD) &&
            (group->type == TSI_SCAN_GROUP_SELF_CAP || group->type == TSI_SCAN_GROUP_SELF_CAP_PARALLEL)) {
        /* Connect idle channel to shield */
        instance->TEST |= (0x1UL << 19U);
        instance->CFGR |= (0x1UL << 4U);
    }
#endif

    /* Setup scan configurations */
    instance->CFGR &= ~(0xFUL << 28U);          /* No multi sample */
    instance->CFGR &= ~(0x3UL << 22U);          /* Scan mode */
    switch(group->type) {
        case TSI_SCAN_GROUP_SELF_CAP:
            instance->CFGR |= (0x1UL << 22U);
            break;
        case TSI_SCAN_GROUP_SELF_CAP_PARALLEL:
            instance->CFGR |= (0x0UL << 22U);
            break;
        case TSI_SCAN_GROUP_MUTUAL_CAP:
            instance->CFGR |= (0x2UL << 22U);
            break;
        default:
            return TSI_PARAM_ERR;
    }
    instance->CFGR |= (0x1UL << 20U);           /* Enable wait */
    instance->CFGR &= ~(0x1UL << 7U);           /* Disable hw average */
    instance->CFGR &= ~(0x1UL << 5U);           /* Software trigged */

    /* Enable interrupts / DMA */
    if(drv->scanMode == TSI_DRV_SCAN_MODE_BLOCKING ||
            drv->scanMode == TSI_DRV_SCAN_MODE_IT) {
#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
        TSI_StopDMA(instance);
#endif
        TSI_EnableIT(instance);
    }
#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
    else if(drv->scanMode == TSI_DRV_SCAN_MODE_DMA) {
        TSI_DisableIT(instance);
        TSI_StartDMA(instance,
                     snsConf->conf,
                     devPrivate->sensorData[drv->freqIdx],
                     devPrivate->snsNum);
        TSI_INFO("TSI_Dev_SetupScanGroup() - Start DMA with "
                 "TxAddr 0x%08X, RxAddr 0x%08X, size %d",
                 (uint32_t)snsConf->conf,
                 (uint32_t)devPrivate->sensorData[drv->freqIdx],
                 devPrivate->snsNum);
    }
#endif

    /* Start scan */
    instance->CR |= (0x1UL << 0U);

    return TSI_PASS;
}

TSI_RetCode TSI_Dev_StopScan(TSI_DriverTypeDef *drv)
{
    TSI_Type *instance = INSTANCES[drv->instanceId];

    /* Stop scan */
    instance->CR |= (0x1UL << 2U);

    /* Disable interrupts / DMA */
    if(drv->scanMode == TSI_DRV_SCAN_MODE_BLOCKING ||
            drv->scanMode == TSI_DRV_SCAN_MODE_IT) {
        TSI_DisableIT(instance);
    }
#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
    else if(drv->scanMode == TSI_DRV_SCAN_MODE_DMA) {
        TSI_StopDMA(instance);
    }
#endif

    return TSI_PASS;
}

void TSI_Dev_Handler(TSI_DriverTypeDef *drv)
{
    TSI_Type *instance = INSTANCES[drv->instanceId];
    TSI_DevPrivateTypeDef *devPrivate = (TSI_DevPrivateTypeDef *) drv->context;
    const TSI_ScanGroupTypeDef *group = &drv->scanGroups[drv->scanGroupIdx];
    TSI_DevSnsConfTypeDef *snsConf;

    /*-----------------------------------*/
    /* TSI interrupts                    */
    /*-----------------------------------*/
    if((instance->IER & (0x1UL << 1U)) != 0UL &&
            (instance->ISR & (0x1UL << 1U)) != 0UL) {
        instance->ISR = (0x1UL << 1U);
        if(drv->scanMode != TSI_DRV_SCAN_MODE_DMA) {
            /* Save data to sensor struct */
            uint16_t snsIdx = devPrivate->snsIdx;
            uint16_t rawCount;
            TSI_SensorTypeDef *sensor;

            if(snsIdx >= group->size) {
                /* Error: Stop scan and return. */
                (void)TSI_Drv_StopScan(drv);
                TSI_DRV_SET_STAT(drv, TSI_DRV_STAT_SCAN_ERROR);
                return;
            }

            if(group->type == TSI_SCAN_GROUP_SELF_CAP) {
                sensor = drv->sensors[devPrivate->enabledSensors[snsIdx]];
            }
            else if(group->type == TSI_SCAN_GROUP_SELF_CAP_PARALLEL) {
                if(snsIdx >= 1U) {
                    /* Error: Stop scan and return. */
                    (void)TSI_Drv_StopScan(drv);
                    TSI_DRV_SET_STAT(drv, TSI_DRV_STAT_SCAN_ERROR);
                    return;
                }
                sensor = drv->sensors[group->sensors[snsIdx]];
            }
            else if(group->type == TSI_SCAN_GROUP_MUTUAL_CAP) {
                sensor = drv->sensors[group->sensors[snsIdx]];
            }
            else {
                /* Cannot be here */
                TSI_ASSERT(0U);
                return;
            }

