GUdaoxi/FH_project/TSI/Library/Devices/fm33fh0xx_tsi_driver.c
#ifdef TSI_LIB_USE_ASSERT
            /* Check sensor TX and RX channel */
            TSI_ASSERT(sensor->meta->rxChannel == TSI_GetRxChannel(instance->RAWCNTR));
            if(group->type == TSI_SCAN_GROUP_MUTUAL_CAP) {
                TSI_ASSERT(sensor->meta->txChannel == TSI_GetTxChannel(instance->RAWCNTR));
            }
#endif
            TSI_INFO("IRQ: EOC ------------");
            rawCount = (uint16_t)(TSI_ReadData(instance) & 0xFFFFUL);
            TSI_Drv_HandleSensorData(drv, sensor, rawCount);

            /*
                - Self-cap scan group: Goto next sensor.
                - Self-cap parallel scan group: skip.
                - Mutual-cap scan group: Goto next sensor.
            */
            if(group->type == TSI_SCAN_GROUP_SELF_CAP_PARALLEL) {
                devPrivate->snsIdx = snsIdx + 1U;
                return;
            }
            if(++snsIdx < devPrivate->snsNum) {
                /* Setup next configuration */
                snsConf = &devPrivate->sensorConfs[drv->freqIdx];
                instance->SPCFGR = snsConf->conf[snsIdx];
                TSI_SetIDAC1Step(instance, snsConf->idac1Step[snsIdx]);
                TSI_SetIDAC2Step(instance, snsConf->idac2Step[snsIdx]);
#ifndef TSI_UNIT_TEST
                if(group->type == TSI_SCAN_GROUP_SELF_CAP) {
                    TSI_LoadIDAC1Trim(instance, snsConf->idac1Step[snsIdx], TSI_IDAC_DIR_SOURCE);
                    TSI_LoadIDAC2Trim(instance, snsConf->idac2Step[snsIdx], TSI_IDAC_DIR_SOURCE);
                }
                else if(group->type == TSI_SCAN_GROUP_MUTUAL_CAP) {
                    TSI_LoadIDAC1Trim(instance, snsConf->idac1Step[snsIdx], TSI_IDAC_DIR_SOURCE);
                    TSI_LoadIDAC2Trim(instance, snsConf->idac2Step[snsIdx], TSI_IDAC_DIR_SINK);
                }
                else {
                    /* Cannot be here */
                    TSI_ASSERT(0U);
                }
#endif  /* TSI_UNIT_TEST */

                /* Setup scan group options */
                if((group->opt & TSI_DEV_OPT_IDLE_CONNECTION_MASK) == TSI_DEV_OPT_IDLE_GROUNDED) {
                    TSI_SensorTypeDef *sensor = NULL;
                    if(group->type == TSI_SCAN_GROUP_SELF_CAP) {
                        sensor = drv->sensors[devPrivate->enabledSensors[snsIdx]];
                    }
                    else if(group->type == TSI_SCAN_GROUP_MUTUAL_CAP) {
                        sensor = drv->sensors[group->sensors[snsIdx]];
                    }
                    else {
                        /* Do nothing */
                    }
                    if(sensor != NULL) {
                        /* Set other channel output to GND */
                        TSI_SetGroundOutput(drv, sensor);
                    }
                }

                /* Continue */
                instance->CR |= (0x1UL << 1U);
            }
            /* Update variable value */
            devPrivate->snsIdx = snsIdx;
            TSI_INFO("---------------------");
        }
    }
    else if((instance->IER & (0x1UL << 2U)) != 0UL &&
            (instance->ISR & (0x1UL << 2U)) != 0UL) {
        TSI_INFO("IRQ: EOS ------------");
        instance->ISR = (0x1UL << 2U);
        if(devPrivate->snsIdx < devPrivate->snsNum)  {
            /* Something is error. */
            (void)TSI_Drv_StopScan(drv);
            TSI_DRV_SET_STAT(drv, TSI_DRV_STAT_SCAN_ERROR);
            return;
        }

        if((group->opt & TSI_DEV_OPT_IDLE_CONNECTION_MASK) == TSI_DEV_OPT_IDLE_GROUNDED) {
            /* Restore all port to default */
            TSI_ResetGroundOutput(drv);
        }

        /* Notify scan completed */
        TSI_Drv_HandleEndOfScan(drv);
        TSI_INFO("---------------------");
    }

#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))
    /*-----------------------------------*/
    /* DMA interrupts                    */
    /*-----------------------------------*/
    if((DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) & (0x1UL << 2U)) != 0UL &&
            (DMA->ISR & (0x1UL << (8U + TSI_DMA_RD_CHANNEL))) != 0UL) {
        uint16_t snsRealIdx = 0U;   /* for resolving self-cap data index. */
        uint32_t *snsData = devPrivate->sensorData[drv->freqIdx];

        TSI_INFO("IRQ: DMA EOS --------");
        /* Stop DMA and clear flags */
        TSI_StopDMA(instance);

        /* Save data to sensor struct */
        TSI_FOREACH_IDX(uint16_t snsIdx, group->sensors, group->size, 0U) {
            /*
                - Self-cap scan group: scan data will skip disabled sensor.
                - Self-cap parallel scan group: do not care.
                - Mutual-cap scan group: do not care.
            */
            TSI_SensorTypeDef *sensor = drv->sensors[snsIdx];
            if(group->type == TSI_SCAN_GROUP_SELF_CAP) {
                TSI_WidgetTypeDef *widget = sensor->meta->parent;
                if(widget->enable == 0U) { continue; }
            }
#ifdef TSI_LIB_USE_ASSERT
            /* Check sensor TX and RX channel */
            TSI_ASSERT(sensor->meta->rxChannel == TSI_GetRxChannel(snsData[snsRealIdx]));
            if(group->type == TSI_SCAN_GROUP_MUTUAL_CAP) {
                TSI_ASSERT(sensor->meta->txChannel == TSI_GetTxChannel(snsData[snsRealIdx]));
            }
#endif
            TSI_Drv_HandleSensorData(drv, sensor, snsData[snsRealIdx] & 0xFFFFUL);
            snsRealIdx++;
            TSI_DEBUG("sensor(%s #%d, Tx%02d Rx%02d): %5d",
                      (sensor->meta->type == TSI_SENSOR_SELF_CAP) ? "Self" : "Mutual",
                      drv->freqIdx,
                      sensor->meta->txChannel, sensor->meta->rxChannel,
                      sensor->bslnVar.sensorBuffer[drv->freqIdx]);
        }
        TSI_FOREACH_END()

        /* Notify scan completed */
        TSI_Drv_HandleEndOfScan(drv);
        TSI_INFO("---------------------");
    }
#endif
}

uint32_t TSI_Dev_GetModClock(TSI_ClockConfTypeDef *clockConf)
{
    uint32_t tmpClock = TSI_DEV_OP_CLOCK_FREQ;
    tmpClock /= clockConf->modClockPsc;
    return tmpClock;
}

uint32_t TSI_Dev_GetSCSnsInputClock(TSI_ClockConfTypeDef *clockConf)
{
    uint32_t tmpClock;
    if(clockConf->snsClockSrc == 0U) {
        /* Modulator clock */
        tmpClock = TSI_Dev_GetModClock(clockConf);
    }
    else if(clockConf->snsClockSrc == 1U) {
        /* TSI_PLL VCO clock */
        tmpClock = (uint32_t)clockConf->pllMul * 2000000UL;
    }
    else {
        TSI_ASSERT(0U);
        tmpClock = TSI_DATA_INVALID;
    }
    return (tmpClock / 2U);
}

uint32_t TSI_Dev_GetMCSnsInputClock(TSI_ClockConfTypeDef *clockConf)
{
    uint32_t tmpClock;
    if(clockConf->snsClockSrc == 0U) {
        /* Modulator clock */
        tmpClock = TSI_Dev_GetModClock(clockConf);
    }
    else if(clockConf->snsClockSrc == 1U) {
        /* TSI_PLL VCO clock */
        tmpClock = (uint32_t)clockConf->pllMul * 2000000UL;
    }
    else {
        TSI_ASSERT(0U);
        tmpClock = TSI_DATA_INVALID;
    }
    return tmpClock;
}

uint32_t TSI_Dev_GetSCSwitchClock(TSI_ClockConfTypeDef *clockConf, uint32_t snsDiv)
{
    uint32_t tmpClock = TSI_Dev_GetSCSnsInputClock(clockConf);
    if(tmpClock == TSI_DATA_INVALID) {
        return tmpClock;
    }
    if(clockConf->snsClockSel == 0U || clockConf->snsClockSel == 2U) {
        /* Direct clock / SSC clock */
        tmpClock /= snsDiv;
    }
    else if(clockConf->snsClockSel == 1U) {
        /* PRS clock */
        tmpClock /= (snsDiv * 2U);
    }
    else {
        TSI_ASSERT(0U);
        tmpClock = TSI_DATA_INVALID;
    }
    return tmpClock;
}

uint32_t TSI_Dev_GetMCTXClock(TSI_ClockConfTypeDef *clockConf, uint32_t snsDiv)
{
    uint32_t tmpClock = TSI_Dev_GetMCSnsInputClock(clockConf);
    return (tmpClock / snsDiv);
}

